{
  "id": 27,
  "title": "Chương 27",
  "verses": [
    {
      "text": [
        "Người lữ hành giỏi không có lịch trình cố định",
        "nhưng biết khi nào mình đã đến nơi.",
        "Người nghệ sĩ giỏi theo trực giác",
        "bất cứ nơi nào nó dẫn dắt.",
        "Người khoa học giỏi buông bỏ khái niệm",
        "và giữ tâm trí mở với những gì đang là."
      ]
    },
    {
      "text": [
        "Cho nên Người lập trình thể đạo mở lòng với tất cả,",
        "chấp nhận con đường riêng của mỗi người là tốt nhất cho họ.",
        "Đây gọi là theo ánh sáng nội tâm.",
        "Người lập trình giỏi là gì,",
        "ngoài cảm hứng của người lập trình kém.",
        "Người lập trình kém là gì,",
        "ngoài thử thách của người lập trình giỏi.",
        "Nếu bạn bỏ lỡ điều này, bạn sẽ lạc lối",
        "dù bạn thông minh đến đâu.",
        "Bởi vì đó là bí mật lớn lao."
      ]
    },
    {
      "text": [
        "## Chú thích"
      ]
    },
    {
      "text": [
        "Chương này nhấn mạnh **tính tương hỗ và sự khiêm tốn** trong cộng đồng lập trình. \"Người lữ hành không lịch trình\" tượng trưng cho tư duy Agile - linh hoạt thích ứng với thay đổi thay vì bám cứng kế hoạch. \"Nghệ sĩ theo trực giác\" phản ánh quá trình coding qua trải nghiệm cá nhân, nơi pattern recognition quan trọng hơn lý thuyết suông."
      ]
    },
    {
      "text": [
        "Việc \"mở lòng với tất cả\" thể hiện tinh thần **pair programming** lý tưởng: tôn trọng cách tiếp cận khác biệt, coi mọi ý tưởng đều đáng cân nhắc. \"Ánh sáng nội tâm\" là khả năng phân biệt giữa solution khả thi và over-engineering thông qua kinh nghiệm tích lũy."
      ]
    },
    {
      "text": [
        "Mối quan hệ giữa lập trình viên giỏi và kém ví von **vòng đời mentorship**: người mới là động lực để senior đào sâu kiến thức, ngược lại senior là la bàn định hướng. \"Bí mật lớn lao\" chính là sự thừa nhận rằng **không ai hoàn toàn giỏi hay kém** - mỗi người đều có blind spot cần được balance bởi cộng đồng."
      ]
    }
  ]
}